tap "azure/functions"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "romkatv/powerlevel10k"
brew "bat"
brew "openldap"
brew "exa"
brew "gh"
brew "git"
brew "xz"
brew "httpie"
brew "nvm"
brew "php"
brew "pyenv"
brew "rsync"
brew "tree"
brew "zsh-syntax-highlighting"
brew "azure/functions/azure-functions-core-tools"
cask "alfred"
cask "gitkraken"
cask "google-chrome"
cask "iterm2"
cask "postman"
cask "powershell"
cask "visual-studio-code"
