tap "1password/tap"
tap "azure/functions"
tap "blacktop/tap"
tap "eth-p/software"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "ngrok/ngrok"
tap "nikitabobko/tap"
tap "probe-rs/probe-rs"
tap "romkatv/powerlevel10k"
# JPEG image codec that aids compression and decompression
brew "jpeg-turbo"
# General-purpose data compression with high compression ratio
brew "xz"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# C library implementing the SSH2 protocol
brew "libssh2"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Asynchronous DNS library
brew "c-ares"
# XML-based font configuration API for X Windows
brew "fontconfig"
# Cross-platform make
brew "cmake"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# Modern, maintained replacement for ls
brew "eza"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Easy to use base16 scheme manager that integrates with any workflow
brew "flavours"
# Terminal JSON viewer
brew "fx"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Pager program similar to more
brew "less"
# Next-gen compiler infrastructure
brew "llvm"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Mac App Store command-line interface
brew "mas"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node"
# Utility that provides fast incremental file transfer
brew "rsync"
# OCaml package manager
brew "opam"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Fast, disk space efficient package manager
brew "pnpm"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Implementation of Telnet and SSH
brew "putty"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Cross-shell prompt for astronauts
brew "starship"
# TOML toolkit written in Rust
brew "taplo"
# Terminal multiplexer
brew "tmux"
# Command-line interface for Vercel
brew "vercel-cli"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Azure Functions Core Tools 4.0
brew "azure/functions/azure-functions-core-tools@4"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# A collection of on chip debugging tools to communicate with microchips.
brew "probe-rs/probe-rs/probe-rs"
# Command-line interface for 1Password
cask "1password-cli"
# Sound and music editor
cask "ableton-live-suite"
# Professional graphic design software
cask "affinity-designer"
# Professional image editing software
cask "affinity-photo"
# Professional desktop publishing software
cask "affinity-publisher"
# Application launcher and productivity software
cask "alfred"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Electronics prototyping platform
cask "arduino-ide"
# Records audio from any application
cask "audio-hijack"
# Integrated CAD, CAM, CAE, and PCB software
cask "autodesk-fusion"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Menu bar icon organiser
cask "bartender"
# Universal chat app powered by Matrix
cask "beeper"
# Display management tool
cask "betterdisplay"
# 3D creation suite
cask "blender"
# E-books management software
cask "calibre"
# Free and open-source web browser
cask "chromium"
# Flexible space to create your own interactive software
cask "cycling74-max"
# Disk space visualiser
cask "daisydisk"
# Database version management tool
cask "dbngin"
# Voice and text chat software
cask "discord"
# NDI integration for OBS Studio
cask "distroav"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Developer platform
cask "dotnet-runtime"
# Online diagram software
cask "drawio"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
cask "font-aileron"
cask "font-anek-bangla"
cask "font-anek-devanagari"
cask "font-anek-gujarati"
cask "font-anek-gurmukhi"
cask "font-anek-kannada"
cask "font-anek-latin"
cask "font-anek-malayalam"
cask "font-anek-odia"
cask "font-anek-tamil"
cask "font-anek-telugu"
cask "font-anton"
cask "font-archivo"
cask "font-archivo-black"
cask "font-archivo-narrow"
cask "font-atkinson-hyperlegible"
cask "font-droid-sans-mono-nerd-font"
cask "font-fontawesome"
cask "font-hack-nerd-font"
cask "font-heebo"
cask "font-inter"
cask "font-inter-tight"
cask "font-jetbrains-mono-nerd-font"
cask "font-lato"
cask "font-lexend"
cask "font-meslo-lg-nerd-font"
cask "font-montserrat"
cask "font-open-dyslexic-nerd-font"
cask "font-oswald"
cask "font-red-hat-display"
cask "font-red-hat-mono"
cask "font-red-hat-text"
cask "font-roboto"
cask "font-sora"
cask "font-syne"
cask "font-syne-mono"
cask "font-syne-tactile"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Hex editor focussing on speed
cask "hex-fiend"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Professional audio software for audio recording, mixing, broadcast and others
cask "izotope-product-portal"
# Keyboard customiser
cask "karabiner-elements"
# Electronics design automation suite
cask "kicad"
# Application launcher
cask "leader-key"
# NDI SDK
cask "libndi"
# Software for Logitech devices
cask "logi-options+"
# Cable-free audio router
cask "loopback"
# 2D game framework for Lua
cask "love"
# Speech recognition tool
cask "macwhisper"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# Spreadsheet software
cask "microsoft-excel"
# Presentation software
cask "microsoft-powerpoint"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Word processor
cask "microsoft-word"
# Music tagger
cask "musicbrainz-picard"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organised
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Visual communication software
cask "omnigraffle"
# Project planning and management software
cask "omniplan"
# Cloud storage client
cask "onedrive"
# Desktop virtualization software
cask "parallels"
# Home media player
cask "plex"
# Collaboration platform for API development
cask "postman"
# Command-line shell and scripting language
cask "powershell"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Window snapping tool
cask "rectangle-pro"
# Free Dj app to prepare and manage your music files
cask "rekordbox"
# Screen recorder with audio
cask "screenflick"
# Download manager for Spitfire audio libraries
cask "spitfire-audio"
# Cloud-based music creation and collaboration platform
cask "splice"
# Text editor for code, markup and prose
cask "sublime-text"
# VPN client for secure internet access and private browsing
cask "surfshark"
# Native GUI tool for relational databases
cask "tableplus"
# Firmware flashing utility
cask "teensy"
# Application for interacting with Internet Relay Chat (IRC) chatrooms
cask "textual"
# To-do list
cask "todoist-app"
# Unicode keyboard layout editor
cask "ukelele"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
# Lossless audio decoder
cask "xld"
# Gecko based web browser
cask "zen"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organise, cite, and share research sources
cask "zotero"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Apple Configurator", id: 1037126344
mas "Be Focused Pro", id: 961632517
mas "BetterSnapTool", id: 417375580
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Compressor", id: 424390742
mas "Developer", id: 640199958
mas "Final Cut Pro", id: 424389933
mas "Ground News", id: 1324203419
mas "Instapaper", id: 288545208
mas "Instapaper Save", id: 1481302432
mas "Jayson", id: 1468691718
mas "Jomo", id: 1609960918
mas "Kindle", id: 302584613
mas "Logic Pro", id: 634148309
mas "MacFamilyTree 9", id: 1458866808
mas "Meshtastic", id: 1586432531
mas "Microsoft To Do", id: 1274495053
mas "MODALapp", id: 1187314855
mas "Motion", id: 434290957
mas "OverPicture", id: 1188020834
mas "Swift Playground", id: 1496833156
mas "The Unarchiver", id: 425424353
mas "Userscripts", id: 1463298887
mas "Velja", id: 1607635845
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "ambar.bundle-size"
vscode "azurite.azurite"
vscode "bencoleman.armview"
vscode "blinkshellinc.blink-fs"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.npm-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "dotjoshjohnson.xml"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "fabianlauer.vs-code-xml-format"
vscode "fill-labs.dependi"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "fudgepops.kaitai-struct-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "gruntfuggly.todo-tree"
vscode "heaths.vscode-guid"
vscode "hediet.vscode-drawio"
vscode "irongeek.vscode-env"
vscode "jeandeaual.scheme"
vscode "jock.svg"
vscode "johnnymorganz.stylua"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "maciejdems.add-to-gitignore"
vscode "malmaud.tmux"
vscode "mermade.openapi-lint"
vscode "mkoeppen.generate-data"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azure-load-testing.microsoft-testing"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azure-mcp-server"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.powershell"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "ocamllabs.ocaml-platform"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-twoslash-queries"
vscode "peymanslh.blueberry-dark-theme"
vscode "pkief.material-icon-theme"
vscode "pmndrs.pmndrs"
vscode "postman.postman-for-vscode"
vscode "prisma.prisma"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "ritwickdey.liveserver"
vscode "rkoubou.ksp"
vscode "rust-lang.rust-analyzer"
vscode "sashabusinaro.yaml-compose-sorter"
vscode "shakram02.bash-beautify"
vscode "simonsiefke.svg-preview"
vscode "stivo.tailwind-fold"
vscode "streetsidesoftware.code-spell-checker"
vscode "sukumo28.wav-preview"
vscode "swiftlang.swift-vscode"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "teamsdevapp.vscode-ai-foundry"
vscode "timonwong.shellcheck"
vscode "twxs.cmake"
vscode "tyriar.lorem-ipsum"
vscode "unifiedjs.vscode-mdx"
vscode "vadimcn.vscode-lldb"
vscode "vue.volar"
vscode "wallabyjs.quokka-vscode"
vscode "wokwi.wokwi-vscode"
vscode "yinfei.luahelper"
vscode "yoavbls.pretty-ts-errors"
vscode "yutengjing.open-in-external-app"
vscode "yzhang.markdown-all-in-one"
vscode "zainchen.json"
vscode "zignd.html-css-class-completion"
