tap "1password/tap"
tap "azure/functions"
tap "blacktop/tap"
tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "ngrok/ngrok"
tap "romkatv/powerlevel10k"
# JPEG image codec that aids compression and decompression
brew "jpeg-turbo"
# General-purpose data compression with high compression ratio
brew "xz"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Companion library to apr, the Apache Portable Runtime library
brew "apr-util"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Convert CD images from .bin/.cue to .iso/.cdr
brew "bchunk"
# Asynchronous DNS library
brew "c-ares"
# XML-based font configuration API for X Windows
brew "fontconfig"
# C library implementing the SSH2 protocol
brew "libssh2"
# Open source suite of directory software
brew "openldap"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# C library of Git core methods that is re-entrant and linkable
brew "libgit2"
# Modern replacement for 'ls'
brew "exa"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Image processing and image analysis library
brew "leptonica"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Easy to use base16 scheme manager that integrates with any workflow
brew "flavours"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# Pager program similar to more
brew "less"
# Next-gen compiler infrastructure
brew "llvm"
# Lightning memory-mapped database: key-value data store
brew "lmdb"
# Mac App Store command-line interface
brew "mas"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# General-purpose scripting language
brew "php"
# General-purpose scripting language
brew "php@7.4"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Implementation of Telnet and SSH
brew "putty"
# Python version management
brew "pyenv"
# Utility that provides fast incremental file transfer
brew "rsync"
# Experimental Rust compiler front-end for IDEs
brew "rust-analyzer"
# Cross-shell prompt for astronauts
brew "starship"
# Version control system designed to be a better CVS
brew "subversion"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Tracks most-used directories to make cd smarter
brew "z"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Azure Functions Core Tools 4.0
brew "azure/functions/azure-functions-core-tools@4"
# Organize Your macOS Launchpad Apps
brew "blacktop/tap/lporg"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Sound and music editor
cask "ableton-live-suite"
# Professional graphic design software
cask "affinity-designer"
# Professional image editing software
cask "affinity-photo"
# Professional desktop publishing software
cask "affinity-publisher"
# GPU-accelerated terminal emulator
cask "alacritty"
# Application launcher and productivity software
cask "alfred"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Memory training application
cask "anki"
# Chromium based browser
cask "arc"
# Records audio from any application
cask "audio-hijack"
# Menu bar icon organizer
cask "bartender"
# Universal chat app powered by Matrix
cask "beeper"
# 3D creation suite
cask "blender"
# Open-source browser prompter
cask "browserosaurus"
# Free and open-source web browser
cask "chromium"
# Tool to run Windows software
cask "crossover"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Online diagram software
cask "drawio"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
cask "font-anton"
cask "font-archivo"
cask "font-archivo-black"
cask "font-archivo-narrow"
# Font with greater legibility and readability for low vision readers
cask "font-atkinson-hyperlegible"
# Developer targeted fonts with a high number of glyphs
cask "font-droid-sans-mono-nerd-font"
# Icon set and toolkit
cask "font-fontawesome"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
cask "font-heebo"
cask "font-inter"
cask "font-inter-tight"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
cask "font-lato"
# Expanded by font bureau with a range of 8 weights
cask "font-lexend"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
cask "font-montserrat"
# Developer targeted fonts with a high number of glyphs
cask "font-open-dyslexic-nerd-font"
cask "font-oswald"
cask "font-red-hat-display"
cask "font-red-hat-mono"
cask "font-red-hat-text"
# Font with a mechanical skeleton and the forms are largely geometric
cask "font-roboto"
cask "font-sora"
# Typeface originally designed for the art center Synesthésie
cask "font-syne"
# Another take on letting go of control
cask "font-syne-mono"
# Originally designed for the Art Center 'Synesthésie'
cask "font-syne-tactile"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Professional audio software for audio recording, mixing, broadcast and others
cask "izotope-product-portal"
# Electronics design automation suite
cask "kicad"
# Interface for reading and syncing eBooks
cask "kindle"
# Software for Logitech devices
cask "logi-options-plus"
# Cable-free audio router
cask "loopback"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Spreadsheet software
cask "microsoft-excel"
# Email client
cask "microsoft-outlook"
# Presentation software
cask "microsoft-powerpoint"
# Remote desktop client
cask "microsoft-remote-desktop"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Word processor
cask "microsoft-word"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# App to write, plan, collaborate, and get organized
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# NewTek NDI integration for OBS Studio
cask "obs-ndi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Visual communication software
cask "omnigraffle"
# Project planning and management software
cask "omniplan"
# Cloud storage client
cask "onedrive"
# Play PC games and connect with your friends
cask "origin"
# Desktop virtualization software
cask "parallels"
# Collaboration platform for API development
cask "postman"
# Command-line shell and scripting language
cask "powershell"
# Free Dj app to prepare and manage your music files
cask "rekordbox"
# Screen recorder with audio
cask "screenflick"
# Download manager for Spitfire audio libraries
cask "spitfire-audio"
# Cloud-based music creation and collaboration platform
cask "splice"
# Text editor for code, markup and prose
cask "sublime-text"
# VPN client for secure internet access and private browsing
cask "surfshark"
# To-do list
cask "todoist"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Desktop client for WhatsApp
cask "whatsapp"
# Lossless audio decoder
cask "xld"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Apple Configurator", id: 1037126344
mas "Be Focused Pro", id: 961632517
mas "BetterSnapTool", id: 417375580
mas "Compressor", id: 424390742
mas "Developer", id: 640199958
mas "Disk Speed Test", id: 425264550
mas "Final Cut Pro", id: 424389933
mas "Ground News", id: 1324203419
mas "Instapaper", id: 288545208
mas "Instapaper Save", id: 1481302432
mas "Logic Pro", id: 634148309
mas "MacFamilyTree 9", id: 1458866808
mas "Microsoft To Do", id: 1274495053
mas "MODALapp", id: 1187314855
mas "Motion", id: 434290957
mas "OverPicture", id: 1188020834
mas "The Unarchiver", id: 425424353
mas "Userscripts-Mac-App", id: 1463298887
mas "Velja", id: 1607635845
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "Azurite.azurite"
vscode "bencoleman.armview"
vscode "blinkshellinc.blink-fs"
vscode "bradlc.vscode-tailwindcss"
vscode "bungcip.better-toml"
vscode "christian-kohler.npm-intellisense"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "DotJoshJohnson.xml"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "GitHub.vscode-pull-request-github"
vscode "hediet.vscode-drawio"
vscode "IronGeek.vscode-env"
vscode "jeandeaual.scheme"
vscode "maciejdems.add-to-gitignore"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azuretools.azure-dev"
vscode "ms-azuretools.vscode-azureappservice"
vscode "ms-azuretools.vscode-azurecontainerapps"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-azurestaticwebapps"
vscode "ms-azuretools.vscode-azurestorage"
vscode "ms-azuretools.vscode-azurevirtualmachines"
vscode "ms-azuretools.vscode-bicep"
vscode "ms-azuretools.vscode-cosmosdb"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-python.autopep8"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.azurecli"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.hexeditor"
vscode "ms-vscode.powershell"
vscode "ms-vscode.vscode-node-azure-pack"
vscode "msazurermtools.azurerm-vscode-tools"
vscode "oderwat.indent-rainbow"
vscode "Orta.vscode-twoslash-queries"
vscode "PKief.material-icon-theme"
vscode "pmndrs.pmndrs"
vscode "Prisma.prisma"
vscode "quicktype.quicktype"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.LiveServer"
vscode "rkoubou.ksp"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "sukumo28.wav-preview"
vscode "Tyriar.lorem-ipsum"
vscode "unifiedjs.vscode-mdx"
vscode "WallabyJs.quokka-vscode"
vscode "yinfei.luahelper"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "ZainChen.json"
vscode "Zignd.html-css-class-completion"
