tap "azure/functions"
tap "blacktop/tap"
tap "eth-p/software"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "romkatv/powerlevel10k"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Open source suite of directory software
brew "openldap"
# General-purpose data compression with high compression ratio
brew "xz"
# Modern replacement for 'ls'
brew "exa"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Pager program similar to more
brew "less"
# Mac App Store command-line interface
brew "mas"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Manage multiple Node.js versions
brew "nvm"
# General-purpose scripting language
brew "php"
# General-purpose scripting language
brew "php@7.4"
# Python version management
brew "pyenv"
# Utility that provides fast incremental file transfer
brew "rsync"
# Cross-shell prompt for astronauts
brew "starship"
# Version control system designed to be a better CVS
brew "subversion"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Azure Functions Core Tools 2.0
brew "azure/functions/azure-functions-core-tools"
# Azure Functions Core Tools 2.0
brew "azure/functions/azure-functions-core-tools@2", link: false
# Azure Functions Core Tools 4.0
brew "azure/functions/azure-functions-core-tools@4"
# Organize Your macOS Launchpad Apps
brew "blacktop/tap/lporg"
# Bash scripts that integrate bat with various command-line tools
brew "eth-p/software/bat-extras"
# Sound and music editor
cask "ableton-live-suite"
# Application launcher and productivity software
cask "alfred"
# Memory training application
cask "anki"
# Records audio from any application
cask "audio-hijack"
# Menu bar icon organizer
cask "bartender"
# 3D creation suite
cask "blender"
# Free and open-source web browser
cask "chromium"
# Tool to run Windows software
cask "crossover"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Draw.io is free online diagram software
cask "drawio"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
cask "font-anton"
cask "font-archivo"
cask "font-archivo-black"
cask "font-archivo-narrow"
# Font with greater legibility and readability for low vision readers
cask "font-atkinson-hyperlegible"
# Developer targeted fonts with a high number of glyphs
cask "font-droid-sans-mono-nerd-font"
# Icon set and toolkit
cask "font-fontawesome"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
cask "font-heebo"
cask "font-inter"
cask "font-inter-tight"
cask "font-lato"
# Expanded by font bureau with a range of 8 weights
cask "font-lexend"
# Developer targeted fonts with a high number of glyphs
cask "font-meslo-lg-nerd-font"
cask "font-montserrat"
# Developer targeted fonts with a high number of glyphs
cask "font-open-dyslexic-nerd-font"
cask "font-oswald"
cask "font-red-hat-display"
cask "font-red-hat-mono"
cask "font-red-hat-text"
# Font with a mechanical skeleton and the forms are largely geometric
cask "font-roboto"
cask "font-sora"
# Typeface originally designed for the art center Synesthésie
cask "font-syne"
# Another take on letting go of control
cask "font-syne-mono"
# Originally designed for the Art Center 'Synesthésie'
cask "font-syne-tactile"
# Git client focusing on productivity
cask "gitkraken"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Professional audio software for audio recording, mixing, broadcast and others
cask "izotope-product-portal"
# Electronics design automation suite
cask "kicad"
# Interface for reading and syncing eBooks
cask "kindle"
# Software for Logitech devices
cask "logi-options-plus"
# Cable-free audio router
cask "loopback"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Spreadsheet software
cask "microsoft-excel"
# Email client
cask "microsoft-outlook"
# Presentation software
cask "microsoft-powerpoint"
# Remote desktop client
cask "microsoft-remote-desktop"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Word processor
cask "microsoft-word"
# App to write, plan, collaborate, and get organized
cask "notion"
# Open-source software for live streaming and screen recording
cask "obs"
# NewTek NDI integration for OBS Studio
cask "obs-ndi"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Visual communication software
cask "omnigraffle"
# Project planning and management software
cask "omniplan"
# Cloud storage client
cask "onedrive"
# Play PC games and connect with your friends
cask "origin"
# Desktop virtualization software
cask "parallels"
# Collaboration platform for API development
cask "postman"
# Command-line shell and scripting language
cask "powershell"
# Screen recorder with audio
cask "screenflick"
# Download manager for Spitfire audio libraries
cask "spitfire-audio"
# Cloud-based music creation and collaboration platform
cask "splice"
# Text editor for code, markup and prose
cask "sublime-text"
# VPN client for secure internet access and private browsing
cask "surfshark"
# To-do list
cask "todoist"
# Tool for creating dynamic digital art
cask "touchdesigner"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Desktop client for WhatsApp
cask "whatsapp"
# Lossless audio decoder
cask "xld"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Apple Configurator", id: 1037126344
mas "Be Focused Pro", id: 961632517
mas "BetterSnapTool", id: 417375580
mas "Compressor", id: 424390742
mas "Disk Speed Test", id: 425264550
mas "Final Cut Pro", id: 424389933
mas "Ground News", id: 1324203419
mas "Instapaper", id: 288545208
mas "Instapaper Save", id: 1481302432
mas "Logic Pro", id: 634148309
mas "MacFamilyTree 9", id: 1458866808
mas "Microsoft To Do", id: 1274495053
mas "Motion", id: 434290957
mas "OverPicture", id: 1188020834
mas "The Unarchiver", id: 425424353
mas "Userscripts", id: 1463298887
mas "Xcode", id: 497799835
